/*
 * EEPROM.h
 *
 *  Created on: 27 авг. 2021 г.
 *      Author: User
 */

#ifndef INC_EEPROM_H_
#define INC_EEPROM_H_

  //****************************************************************************** 
  //  Секция include: здесь подключаются заголовочные файлы используемых модулей 
  //****************************************************************************** 
#include <stdint.h> 
#include <STM32.h>
  //****************************************************************************** 
  //  Секция определения констант 
  //****************************************************************************** 
  #define FLASH_PEKEY1               (0x89ABCDEFU) /*!< Flash program erase key1 */
  #define FLASH_PEKEY2               (0x02030405U) /*!< Flash program erase key: used with FLASH_PEKEY2*/

  //****************************************************************************** 
  //  Секция определения типов 
  //****************************************************************************** 
  //typedef struct  
  //{ 
  //    ... 
  //} T_STRUCT; 

  //typedef ... 

  //****************************************************************************** 
  //  Секция определения глобальных переменных 
  //****************************************************************************** 
  //extern char GlobalVar1; 
  //extern char GlobalVar2; 
  //****************************************************************************** 
  //  Секция прототипов глобальных функций 
  //****************************************************************************** 
  bool FLASH_DATAEEPROM_Unlock(void);
  //****************************************************************************** 
  //  Секция определения макросов 
  //****************************************************************************** 
  //#define MACRO1    M1
  //#define MACRO2    M2

// Закрывающий #endif к блокировке повторного включения 

#endif /* INC_EEPROM_H_ */
