//---------------------------------
// main.h
// Плата индикации (MDR32)
//---------------------------------

#ifdef __cplusplus
extern "C" {
#endif

#include "MDR32Fx.h"
#include "MDR32F9Qx_rst_clk.h"
#include "MDR32F9Qx_port.h"
//---------------------------------

//---------------------------------
#ifndef _MAIN
#define _MAIN
//---------------------------------
// Прототипы функций
//---------------------------------

//---------------------------------
#endif

#ifdef __cplusplus
}
#endif
